Repository: blockbasti/just_another_workout_timer
Catalog: lib/l10n/intl_*.arb
Languages: de, fr, it, pl, ru, tr, zh_cn

source: Add exercise
de: Übung hinzufügen
fr: Ajouter exercice
it: Aggiungi un esercizio
pl: Dodaj ćwiczenie
ru: Добавить упражнение
tr: Egzersiz ekle
zh_cn: 添加动作

source: Add rest
de: Pause hinzufügen
fr: Ajouter repos
it: Aggiungi una pausa
pl: Dodaj przerwę
ru: Добавить отдых
tr: Dinlenme ekle
zh_cn: 添加休息

source: Add Set
de: Satz hinzufügen
fr: Ajouter série
it: Aggiungi una sessione
pl: Dodaj zestaw
ru: Добавить комплекс упражнений
tr: Set ekle
zh_cn: 添加组

source: Add workout
de: Workout erstellen
fr: Ajouter programme
it: Inizia l'allenamento
pl: Dodaj trening
ru: Добавить тренировку
tr: Program ekle
zh_cn: 添加锻炼

source: Announce upcoming exercise
de: nächste Übung ansagen
fr: Annoncer l'exercice suivant
it: Annuncia il successivo esercizio
pl: Ogłaszaj następne ćwiczenie
ru: Предупреждать о следующем упражнении
tr: Sıradaki egzersizi bildir
zh_cn: 宣读即将开始的动作

# AnnounceUpcomingExerciseDesc
source: When TTS is enabled, announce the upcoming exercise
de: Wenn TTS aktiviert ist, wird die nächste Übung angesagt
fr: Si TTS est activé, annoncer l'exercice à venir
it: Quando TTS è abilitato annuncierà l'esercizio seguente
pl: Gdy TTS jest włączone, ogłaszaj następne ćwiczenie
ru: Когда TTS включен, сообщать о следующем упражнения
tr: TTS etkin olduğunda, sıradaki egzersizi bildir
zh_cn: TTS 启用时，宣读即将开始的动作

source: Backup
de: Sicherung
fr: Sauvegarde
pl: Kopia zapasowa
tr: Yedekleme
zh_cn: 备份

source: Cancel
de: Abbrechen
fr: Annuler
it: Annulla
pl: Anuluj
ru: Отмена
tr: İptal
zh_cn: 取消

source: {count} repetitions
de: {count} Wiederholungen
fr: {count} répétitions
it: {count} Ripetizioni
pl: {count} powtórzeń
ru: {count} повторений
tr: {count} tekrar
zh_cn: 重复 {count} 次

source: Current set
de: Aktueller Satz
fr: Série actuelle
it: Sessione attuale
pl: Bieżący zestaw
ru: Текущий комплекс упражнений
tr: Şu anki set
zh_cn: 当前组

source: Delete
de: Löschen
fr: Supprimer
it: Cancella
pl: Usuń
ru: Удалить
tr: Sil
zh_cn: 删除

# deleteConfirmation
source: Would you like to delete the workout "{title}"?
de: Möchtest du das Workout "{title}" wirklich löschen?
fr: Voulez-vous supprimer le programme "{title}" ?
it: Vuoi veramente cancellare l'allenamento "{title}"?
pl: Czy chcesz usunąć trening "{title}"?
ru: Вы бы хотели удалить тренировку "{title}"?
tr: "{title}" programını silmek ister misiniz?
zh_cn: 您想要删除锻炼“{title}”吗？

source: Delete exercise
de: Übung löschen
fr: Supprimer exercice
it: Cancella l'esercizio
pl: Usuń ćwiczenie
ru: Удалить упражнение
tr: Egzersizi sil
zh_cn: 删除动作

source: Delete set
de: Satz löschen
fr: Supprimer série
it: Cancella la sessione
pl: Usuń zestaw
ru: Удалить комплекс упражнений
tr: Seti sil
zh_cn: 删除组

source: Delete workout
de: Workout löschen
fr: Supprimer programme
it: Cacella l'allenamento
pl: Usuń trening
ru: Удалить тренировку
tr: Programı sil
zh_cn: 删除锻炼

source: Duplicate
de: Duplizieren
fr: Dupliquer
it: Duplicare
pl: Duplikuj
ru: Дублировать
tr: Çoğalt
zh_cn: 复制

# durationLeft
source: {timeLeft} of {timeTotal} left
de: {timeLeft} von {timeTotal} übrig
fr: {timeLeft} restant sur {timeTotal}
it: {timeLeft} su {timeTotal} mancanti
pl: pozostało {timeLeft} z {timeTotal}
ru: {timeLeft} из {timeTotal} осталось
tr: Kalan süre: {timeLeft}-{timeTotal}
zh_cn: 剩余 {timeLeft}，共 {timeTotal}

# durationWithTime
source: Duration: {formattedTime}
de: Dauer: {formattedTime}
fr: Durée : {formattedTime}
it: Durata: {formattedTime}
pl: Czas trwania: {formattedTime}
ru: Продолжительность: {formattedTime}
tr: Süre: {formattedTime}
zh_cn: 持续时间：{formattedTime}

source: Edit workout
de: Workout bearbeiten
fr: Éditer programme
it: Modifica l'allenamento
pl: Edytuj trening
ru: Изменить тренировку
tr: Programı düzenle
zh_cn: 编辑锻炼

# enterWorkoutName
source: Please enter a name for the workout!
de: Bitte einen Namen für das Workout festlegen!
fr: Merci d'entrer un nom pour votre entrainement !
it: Per favore inserisci il nome dell'allenamento!
pl: Podaj nazwę treningu
ru: Пожалуйста, введите название тренировки!
tr: Lütfen program için bir isim giriniz!
zh_cn: 请输入锻炼的名称！

source: Exercise
de: Übung
fr: Exercice
it: Esercizio
pl: Ćwiczenie
ru: Упражнение
tr: Egzersiz
zh_cn: 动作

# exerciseOf
source: Exercise {currentIndex} of {total}
de: Übung {currentIndex} von {total}
fr: Exercice {currentIndex} sur {total}
it: Esercizio {currentIndex} di {total}
pl: Ćwiczenie {currentIndex} z {total}
ru: Упражнение {currentIndex} из {total}
tr: Egzersiz {total}-{currentIndex}
zh_cn: 动作 {currentIndex} / {total}

# exitCheck
source: Are you sure you want to exit?
de: Möchtest du wirklich beenden?
fr: Voulez-vous vraiment quitter ?
it: Vuoi veramente uscire?
pl: Czy na pewno chcesz wyjść?
ru: Вы уверены, что хотите выйти?
tr: Çıkmak istediğinizden emin misiniz?
zh_cn: 您确定要退出吗？

source: Expanded set list
de: Erweiterte Anzeige von Sätzen
fr: Liste de série étendue
it: Espandi la sessione
pl: Rozwinięta lista zestawu
tr: Genişletilmiş set listesi
zh_cn: 展开组列表

# expanded_setlist_info
source: Always show full set
de: Immer ganzen Satz anzeigen
fr: Toujours afficher la série entière
it: Mostra sempre tutta la sessione
pl: Zawsze pokazuj cały zestaw
tr: Her zaman setin tamamını göster
zh_cn: 总是显示完整的组

# export
source: Export all workouts
de: Alle Workouts sichern
fr: Exporter les entraînements
it: Esporta tutti gli allenamenti
pl: Eksportuj wszystkie treningi
tr: Bütün programları dışarı aktar
zh_cn: 导出所有锻炼

# firstExercise
source: First: {name}
de: Beginnen mit: {name}
fr: Premier : {name}
it: Inizia con: {name}
pl: Pierwsze: {name}
ru: Сначала: {name}
tr: İlk: {name}
zh_cn: 第一个动作：{name}

source: General
de: Allgemein
fr: Général
it: Generale
pl: Ogólny
ru: Общее
tr: Genel
zh_cn: 通用

source: Halfway done
de: Hälfte geschafft
fr: Mi-parcours
it: Metà esercizio
pl: Połowa
ru: Наполовину выполнено
tr: Yarısı bitti
zh_cn: 已完成一半

# import
source: Import a backup
de: Sicherung laden
fr: Importer une sauvegarde
it: Importa un backup
pl: Importuj kopię zapasową
tr: Bir yedeği içe aktar
zh_cn: 导入备份

# importedCount
source: Imported {count} workouts
de: {count} Workouts importiert
fr: {count} entraînements importés
it: Importati {count} allenamenti
pl: Zaimportowano {count} treningów
tr: {count} program içe aktarıldı
zh_cn: 已导入 {count} 个锻炼

source: Keep screen awake
de: Bildschirm angeschaltet lassen
fr: Garder l'écran allumé
it: Mantieni schermo sempre acceso
pl: Pozostaw włączony ekran
ru: Предотвратить выключение экрана
tr: Ekranı açık tut
zh_cn: 保持屏幕常亮

source: Language
de: Sprache
fr: Langue
it: Lingua
pl: Język
ru: Язык
tr: Dil
zh_cn: 语言

source: Licenses
de: Lizenzen
fr: Licences
it: Licenze
pl: Licencje
ru: Лицензии
tr: Lisanslar
zh_cn: 许可证

source: Move exercise down
de: Übung nach unten verschieben
fr: Descendre l'exercice
it: Muovi l'esercizio verso il basso
pl: Przenieś ćwiczenie w dół
ru: Опустить упражнение вниз
tr: Egzersizi aşağı taşı
zh_cn: 向下移动动作

source: Move exercise up
de: Übung nach oben verschieben
fr: Monter l'exercice
it: Muovi l'esercizio verso l'alto
pl: Przenieś ćwiczenie w górę
ru: Поднять упражнение вверх
tr: Egzersizi yukarı taşı
zh_cn: 向上移动动作

source: Move set down
de: Satz nach unten verschieben
fr: Descendre la série
it: Muovi la sessione verso il basso
pl: Przenieś zestaw w dół
ru: Опустить комплекс вниз
tr: Seti aşağı taşı
zh_cn: 向下移动组

source: Move set up
de: Satz nach oben verschieben
fr: Monter la série
it: Muovi la sessione verso l'alto
pl: Przenieś zestaw w górę
ru: Поднять комплекс вверх
tr: Seti yukarı taşı
zh_cn: 向上移动组

source: Name
fr: Nom
it: Nome
pl: Nazwa
ru: Название
tr: İsim
zh_cn: 名称

# nextExercise
source: Next: {name}
de: Nächste Übung: {name}
fr: Prochain : {name}
it: Prossimo esercizio: {name}
pl: Następne: {name}
ru: Следующее: {name}
tr: Sırada: {name}
zh_cn: 下一个动作：{name}

source: Next set
de: Nächster Satz
fr: Prochaine série
it: Prossima sessione
pl: Następny zestaw
ru: Следующий комплекс упражнений
tr: Sıradaki set
zh_cn: 下一组

source: No
de: Nein
fr: Non
pl: Nie
ru: Нет
tr: Hayır
zh_cn: 否

# noSound
source: No sound effects
de: kein Ton
fr: Aucun effet sonore
it: Nessun suono
pl: Brak efektów dźwiękowych
ru: Без звуковых эффектов
tr: Ses efekti yok
zh_cn: 不使用音效

# noSoundDesc
source: Mute all sound output
de: Ton stummschalten
fr: Couper tous les sons
it: Non sarà riprodotto alcun suono
pl: Wycisz dźwięk
ru: Выключить все звуки
tr: Bütün ses çıkışlarını sessize al
zh_cn: 静音所有声音输出

# ossLicenses
source: Open Source Licenses
de: Open Source Lizenzen
fr: Licences Open Source
it: Licenza Open Source
pl: Licencje otwartoźródłowe
ru: Open Source лицензии
tr: Açık Kaynak Lisansları
zh_cn: 开源许可证

source: Overwrite existing workout?
de: Existierendes Workout überschreiben?
fr: Remplacer l'entrainement existant ?
it: Vuoi sovrascrivere l'allenamento esistente?
pl: Nadpisać obecny trening?
ru: Перезаписать существующую тренировку?
tr: Var olan programın üzerine yazılsın mı?
zh_cn: 要覆盖已存在的锻炼吗？

source: Play tick every second
de: Jede Sekunde ein Ticken abspielen
fr: Jouer un tictac chaque seconde
it: Riproduci un tick ogni secondo
pl: Odtwórz tyknięcie co sekundę
ru: Издавать щелчок каждую секунду
tr: Her saniye tik sesi oynat
zh_cn: 每秒播放一次嘀嗒声

source: Repetitions:
de: Wiederholungen:
fr: Répetitions :
it: Ripetizioni:
pl: Powtórzeń:
ru: Повторения:
tr: Tekrar:
zh_cn: 重复：

# repOf
source: Repetition {currentIndex} of {total}
de: Wiederholung {currentIndex} von {total}
fr: Répétition {currentIndex} sur {total}
it: Ripetizione {currentIndex} di {total}
pl: Powtórzenie {currentIndex} z {total}
ru: Повторение {currentIndex} из {total}
tr: Tekrar {currentIndex}-{total}
zh_cn: 重复 {currentIndex} / {total}

source: Report issues or request a feature
de: Fehler melden oder neue Funktionen vorschlagen
fr: Reporter un problème ou demander une fonctionnalité
it: Segnala problemi o fai richiesta per nuove implementazioni
pl: Zgłaszaj problemy lub poproś o funkcjonalność
ru: Сообщить о проблемах или запросить функцию
tr: Sorun bildir ya da bir özellik iste
zh_cn: 报告问题或者请求新功能

source: Rest
de: Pause
fr: Repos
it: Riposo
pl: Odpoczynek
ru: Отдых
tr: Dinlenme
zh_cn: 休息

source: Saved
de: Gespeichert
fr: Enregistré
it: Salvato
pl: Zapisany
ru: Сохранено
tr: Kaydedildi
zh_cn: 已保存

source: Save workout
de: Workout speichern
fr: Enregistrer entrainement
it: Salva l'allenamento
pl: Zapisz trening
ru: Сохранить тренировку
tr: Programı kaydet
zh_cn: 保存锻炼

source: Seconds
de: Sekunden
fr: Secondes
it: Secondi
pl: Sekundy
ru: Секунды
tr: Saniyeler
zh_cn: 秒

# setIndex
source: Set {number}
de: Satz {number}
fr: Série {number}
it: Sessione {number}
pl: Zestaw {number}
ru: Комплекс {number}
zh_cn: 第 {number} 组

# setOf
source: Set {currentIndex} of {total}
de: Satz {currentIndex} von {total}
fr: Série {currentIndex} sur {total}
it: Sessione {currentIndex} di {total}
pl: Zestaw {currentIndex} z {total}
ru: Комплекс {currentIndex} из {total}
tr: Set {currentIndex}-{total}
zh_cn: 组 {currentIndex} / {total}

# settingHalfway
source: Play sound or announcement halfway during exercise
de: Ansage oder Ton in der Hälfte der Übung abspielen
fr: Jouer un son ou une annonce à mi-parcours d'un exercice
it: Riproduci un segnale o annuncia la metà esercizio
pl: Odtwarzaj dźwięk lub ogłoszenie w połowie ćwiczenia
ru: Воспроизвести звук или объявление на половине тренировки
tr: Programın yarısında ses çal ya da bildirim yap
zh_cn: 动作进行到一半时播放声音或进行宣告

source: Settings
de: Einstellungen
fr: Paramètres
it: Impostazioni
pl: Ustawienia
ru: Настройки
tr: Ayarlar
zh_cn: 设置

source: Sound output
de: Tonausgabe
fr: Retour audio
it: Uscita suoni
pl: Wyjście dźwięku
ru: Звуки
tr: Ses çıkışı
zh_cn: 声音输出

source: Start workout
de: Workout starten
fr: Démarrer programme
it: Inizia l'allenamento
pl: Rozpocznij trening
ru: Начать тренировку
tr: Programı başlat
zh_cn: 开始锻炼

# tts
source: Text-to-Speech (TTS)
de: Text-zu-Sprache (TTS)
fr: Synthèse vocale (TTS)
it: Sintesi vocale (TTS)
pl: Synteza mowy (TTS)
tr: Metinden konuşmaya (TTS)
zh_cn: 文字转语音（TTS）

# ttsLang
source: TTS Language
de: TTS Sprache
fr: Langue du TTS
it: Lingua TTS
pl: Język TTS
ru: TTS Язык
tr: TTS Dili
zh_cn: TTS 语言

# ttsLangDesc
source: Select a language (only when TTS is enabled)
de: Wähle eine Sprache aus (nur bei aktiviertem TTS)
fr: Choisir une langue (quand TTS est activé seulement)
it: Scegli una lingua (Solo se TTS è attivo)
pl: Wybierz głos (gdy TTS jest załączony)
ru: Выберите язык (только когда TTS включен)
tr: Bir dil seç (yalnızca TTS etkin olduğunda)
zh_cn: 选择一个语言 （仅当 TTS 启用时）

# useSound
source: Use sound effects
de: Töne nutzen
fr: Utiliser les sons
it: Riproduci un segnale sonoro
pl: Użyj efektów dźwiękowych
ru: Использовать звуковые эффекты
tr: Ses efektleri kullan
zh_cn: 使用音效

# useSoundDesc
source: Use simple sounds to indicate starts and endings of exercises
de: Übungsbeginn und -ende mit einfachen Tönen ankündigen
fr: Utiliser des sons simples pour indiquer le début et la fin des exercices
it: Un segnale sonoro indicherà l'inizio e la fine degli esercizi
pl: Sygnalizuj początki i końce ćwiczeń za pomocą dźwięków
ru: Использовать простые звуки, чтобы анонсировать начало и конец упражнения.
tr: Egzersizlerin başlangıcını ve bitişini bildirmek için basit sesler kullan
zh_cn: 使用简单的声音提示动作的开始和结束

# useTTS
source: Use Text-to-Speech
de: Text-zu-Sprache nutzen
fr: Utiliser la synthèse vocale
it: Usa la sintesi vocale Text-To-Speech (TTS)
pl: Użyj syntezy mowy (TTS)
ru: Использовать Text-to-Speech
tr: Metinden-konuşmaya kullan
zh_cn: 使用文字转语音

# useTTSDesc
source: Announce current and upcoming exercises
de: Aktuelle und kommende Übungen ansagen
fr: Annoncer l'exercice en cours et le suivant
it: Annuncia l'attuale e il successivo esercizio
pl: Ogłaszaj bieżące i kolejne ćwiczenia
ru: Анонсировать текущие и предстоящие упражнения
tr: Şu anki ve sıradaki egzersizi bildir
zh_cn: 宣读当前动作和即将开始的动作

source: View License
de: Lizenz anzeigen
fr: Voir Licence
it: Vedi la licenza
pl: Obejrzyj licencję
ru: Посмотреть лицензиию
tr: Lisansı göster
zh_cn: 查看许可证

source: View on GitHub
de: Auf GitHub ansehen
fr: Voir sur GitHub
it: Vedi su GitHub
pl: Obejrzyj na GitHubie
ru: Посмотреть на GitHub
tr: GitHub'da göster
zh_cn: 在 Github 上查看

# viewOSSLicenses
source: View Open Source Licenses
de: Open Source Lizenzen anzeigen
fr: Voir licences Open Source
it: Vedi la licenza Open Source
pl: Wyświetl otwartoźródłowe licencje
ru: Посмотреть Open Source лицензии
tr: Açık kaynak lisanslarını göster
zh_cn: 查看开源许可证

source: Workout complete
de: Workout abgeschlossen
fr: Entrainement terminé
it: Allenamento completato!
pl: Trening zakończony
ru: Тренировка завершена
tr: Program tamamlandı
zh_cn: 锻炼已完成

source: Workouts
fr: Programmes
it: Allenamenti
pl: Treningi
ru: Тренировки
tr: Programlar
zh_cn: 锻炼

source: Yes
de: Ja
fr: Oui
it: Si
pl: Tak
ru: Да
tr: Evet
zh_cn: 是

source: Yes, exit
de: Ja
fr: Oui, quitter
it: Si, esci
pl: Tak, wyjdź
ru: Да, выйти
tr: Evet, çık
zh_cn: 是，退出
